_posts/2016-11-14-tips.html
---
layout: default
title: All tips
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. java</a>
<ul>
<li><a href="#sec-1-1">1.1. decompile android apk</a></li>
</ul>
</li>
<li><a href="#sec-2">2. http</a>
<ul>
<li><a href="#sec-2-1">2.1. content-encoding</a></li>
<li><a href="#sec-2-2">2.2. filename</a></li>
</ul>
</li>
<li><a href="#sec-3">3. ssh</a>
<ul>
<li><a href="#sec-3-1">3.1. 上传本地key到服务器</a></li>
</ul>
</li>
<li><a href="#sec-4">4. google host</a>
<ul>
<li><a href="#sec-4-1">4.1. github</a></li>
</ul>
</li>
<li><a href="#sec-5">5. linux</a>
<ul>
<li><a href="#sec-5-1">5.1. system optimise</a></li>
<li><a href="#sec-5-2">5.2. keyboard</a></li>
<li><a href="#sec-5-3">5.3. network</a></li>
<li><a href="#sec-5-4">5.4. productivity</a></li>
<li><a href="#sec-5-5">5.5. makefile</a></li>
</ul>
</li>
<li><a href="#sec-6">6. emacs</a>
<ul>
<li><a href="#sec-6-1">6.1. key</a></li>
<li><a href="#sec-6-2">6.2. org-mode</a></li>
<li><a href="#sec-6-3">6.3. packages</a></li>
<li><a href="#sec-6-4">6.4. features</a></li>
</ul>
</li>
<li><a href="#sec-7">7. sql</a>
<ul>
<li><a href="#sec-7-1">7.1. distinct</a></li>
</ul>
</li>
<li><a href="#sec-8">8. wireshark</a>
<ul>
<li><a href="#sec-8-1">8.1. tshark</a></li>
</ul>
</li>
<li><a href="#sec-9">9. SSL/TLS</a>
<ul>
<li><a href="#sec-9-1">9.1. 内容加密</a></li>
</ul>
</li>
<li><a href="#sec-10">10. git</a>
<ul>
<li><a href="#sec-10-1">10.1. patch</a></li>
</ul>
</li>
<li><a href="#sec-11">11. android</a>
<ul>
<li><a href="#sec-11-1">11.1. ContentProvider</a></li>
<li><a href="#sec-11-2">11.2. 小米adb</a></li>
<li><a href="#sec-11-3">11.3. run-as</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Speedy</a></li>
<li><a href="#sec-13">13. Algorithm</a>
<ul>
<li><a href="#sec-13-1">13.1. 排序算法</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> java</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> decompile android apk</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-sh">$ unzip app.apk -d app
$ cd app; dex2jar.sh ./classes.dex
$ unzip ./classes_dex2jar.jar -d source
$ jd-gui&amp;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> http</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> content-encoding</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>rfc2616 规定传输的内容可以进行压缩传输，content-length为压缩后的文件大小<br  />
</li>
<li>其中content-encoding可以指定4种值：<br  />
<ol class="org-ol">
<li>gzip, 用gnu zip格式压缩<br  />
</li>
<li>compress, 采用unix的文件压缩程序<br  />
</li>
<li>deflate, 采用zlib格式压缩<br  />
</li>
<li>identity, 没有编码，如果没有content-encoding, 就默认为这种方式<br  />
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> filename</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>filename最早出现在rfc1806 中对"Content-Dispositon" 的定义：<br  />
<p class="verse">
filename-parm := "filename" "=" value;<br  /><br  />
</p>
<p>
value的取值根据rfc822 和rfc1521 定义。<br  />
</p>
</li>
<li>之后rfc2626(1999年http1.1标准），第19.5.1节介绍了"Content-Disposition"的定义[<a href="http://tools.ietf.org/html/rfc2616#section-19.5.1">rfc2616#section-19.5.1</a>]<br  />
<p class="verse">
content-disposition = "Content-Disposition" ":"<br  /><br  />
disposition-type *( ";" disposition-parm )<br  /><br  />
disposition-type = "attachment" | disp-extension-token<br  /><br  />
disposition-parm = filename-parm | disp-extension-parm<br  /><br  />
filename-parm = "filename" "=" quoted-string<br  /><br  />
disp-extension-token = token<br  /><br  />
disp-extension-parm = token "=" ( token | quoted-string )<br  /><br  />
</p>
<p>
其中就定义了filename,标准中指明filename不允许指定文件路径，仅作为完整文件名的最<br  />
后一部分。还有一个例子：Content-Disposition: attachment; filename="fname.ext"。<br  />
由此最早filename应该是"＝"后用（"）包含起来的ASCII码字符串，ISO-8859-1以外的字符<br  />
应根据rfc2047 进行转换转换规则为filename= "<code>?" charset "?" encoding "?" encoded-text "?</code>"。<br  />
</p>
</li>
<li>rfc2231 对rfc2047 的转换规则添加了扩展, 支持filename*= charset "'" [language] "'" encoded-text(percent-encode);<br  />
（根据网上反馈资料，为了适配IE浏览器而采用的是混合模式，即：filename="encoded-text")<br  />
</li>
<li>随着网络的发展，2011年rfc6266 对Content-Disposition 进行了规范。rfc6266指明：<br  />
<p class="verse">
filename-parm = "filename" "=" value | "filename*" "=" ext-value<br  /><br  />
</p>
<ul class="org-ul">
<li>如果使用filename ＝ value, value使用rfc2616的定义<br  />
</li>
<li>如果使用filename *＝ ext-value, ext-value使用rfc5987的定义，rfc5987 规定采用rfc2231 的转换规则<br  />
</li>
</ul>
</li>

<li>总结<br  />
filename可能出现四种编码格式：<br  />
<ul class="org-ul">
<li>rfc2616: filename="filename"<br  />
</li>
<li>rfc2047: filename="<code>?UTF-8?encoding?encoded-filename?</code>"<br  />
</li>
<li>rfc2231: filename*=UTF-8'[en]'percent-encoded-filename<br  />
</li>
<li>IE:      filename="percent-encoded-filename"!<br  />
</li>
</ul>
</li>

<li>算法<br  />
根据上述理论依据，以及参考android的guessfilename函数filename做如下解析：<br  />
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>Content-Disposition != null<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
    <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>get<span style="color: #268bd2;">(</span><span style="color: #b58900;">filename</span>*<span style="color: #268bd2;">)</span> != null<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        rfc2231_decode<span style="color: #268bd2;">()</span>;
    <span style="color: #b58900;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>get<span style="color: #268bd2;">(</span>filename<span style="color: #268bd2;">)</span> != null<span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span>
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>rfc2047_decode<span style="color: #6c71c4;">()</span> == ok<span style="color: #268bd2;">)</span> <span style="color: #859900; font-weight: bold;">return</span>;
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>IE_decode<span style="color: #6c71c4;">()</span> == ok<span style="color: #268bd2;">)</span> <span style="color: #859900; font-weight: bold;">return</span>;
        rfc2616_decode<span style="color: #268bd2;">()</span>;
    <span style="color: #b58900;">}</span>
<span style="color: #2aa198;">}</span> <span style="color: #859900; font-weight: bold;">else</span> <span style="color: #2aa198;">{</span>
    get_file_name_from_url<span style="color: #b58900;">()</span>;
<span style="color: #2aa198;">}</span>
<span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>mimetype != null<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
    append_extention_to_filename<span style="color: #b58900;">()</span>;
<span style="color: #2aa198;">}</span>
</pre>
</div>
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> ssh</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 上传本地key到服务器</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-sh">$ ssh-keygen -t  rsa
$ ssh-copy-id -i ~/.ssh/id_rsa.pub  root@192.168.0.3
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> google host</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> <a href="https://github.com/racaljk/hosts/blob/master/hosts">github</a></h3>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> linux</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> system optimise</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> free memery cache</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
sync &amp; echo 3 &gt; /proc/sys/vm/drop_caches<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> keyboard</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1"><span class="section-number-4">5.2.1</span> swap CAPSLOCK and CTRL</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">

<pre class="src src-sh">$ setxkbmap -option <span style="color: #2aa198;">"ctrl:swapcaps"</span>
$ xmodmap
  <span style="color: #b58900; font-weight: bold;">!</span>
  <span style="color: #b58900; font-weight: bold;">!</span> Swap Caps_Lock and Control_L
  <span style="color: #b58900; font-weight: bold;">!</span>
  remove <span style="color: #268bd2;">Lock</span> = Caps_Lock
  remove <span style="color: #268bd2;">Control</span> = Control_L
  keysym <span style="color: #268bd2;">Control_L</span> = Caps_Lock
  keysym <span style="color: #268bd2;">Caps_Lock</span> = Control_L
  add <span style="color: #268bd2;">Lock</span> = Caps_Lock
  add <span style="color: #268bd2;">Control</span> = Control_L
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2"><span class="section-number-4">5.2.2</span> make CAPSLOCK an additional CTRL</h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
setxkbmap -option "ctrl:nocaps"<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> network</h3>
<div class="outline-text-3" id="text-5-3">
</div><div id="outline-container-sec-5-3-1" class="outline-4">
<h4 id="sec-5-3-1"><span class="section-number-4">5.3.1</span> dns cache cleanup</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
sudo /etc/init.d/dns-clean restart<br  />
</p>
</div>
</div>
<div id="outline-container-sec-5-3-2" class="outline-4">
<h4 id="sec-5-3-2"><span class="section-number-4">5.3.2</span> dns nameserver</h4>
<div class="outline-text-4" id="text-5-3-2">
<ul class="org-ul">
<li>add nameservers to /etc/network/interfaces #only 3<br  />
</li>
<li>add nameservers to /etc/resolvconf/resolv.conf.d/tail<br  />
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-3-3" class="outline-4">
<h4 id="sec-5-3-3"><span class="section-number-4">5.3.3</span> vpn log</h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
tail -f /var/log/syslog<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> productivity</h3>
<div class="outline-text-3" id="text-5-4">
<ol class="org-ol">
<li>paste [按列合并文件]<br  />
</li>
<li>sed -r 's#(.*)(.*)#echo \2#ge' [pass matched group to shell command]<br  />
</li>
</ol>
</div>
</div>
