_org/_posts/2016-11-14-tips.org
*** variable assignments
1, makefile中的变量赋值其实就是字符串替换
2, "=" 递归展开变量：如果变量的定义引用了其它的变量，那么引用会一直展开下去，直到找到被引用的变量的最新的定义，并以此作为改变量的值返回
3, ":=" 简单扩展变量：在变量的定义点，按照被引用的变量的当前值进行展开
4, "+=" 为已定义的变量添加新的值
5, "?=" 赋默认值：如果没有初始化该变量，就给它赋上默认值
** disk
1. 添加ssd硬盘
#+BEGIN_QUOTE
/dev/sdb1       /ssd            ext4    noatime,discard,defaults    0       3
#+END_QUOTE
* emacs
** key
*** Blank
1. 'C-x C-o' :delete-blank-lines [Delete extra blank lines between paragraphs]
*** File mode
**** Open file in c++-mode
1. put "// -*-c++-*-" at the top of the file
2. (add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))
*** lines
1) 'C-o' :open-line [Insert a blank line after the cursor]
2) 'C-M-o' :split-line [new line, and align it at same column of cursor]
3) 'M-^' :join this line to previous line
4) 'C-u M-^' :join following line to this line
*** Indent
1. 'M-/^/' :delete-indentation [join two line, and delete the front indentation of cursor]
2. 'C-M \' :indent-region [indents each line in the “usual” way]
3. '<TAB>' :indent-region
4. 'C-x <TAB>' :indent-rigidly
5. 'M-m' :back-to-indentation
*** Spaces
1. 'M-\' :delete-horizontal-space [deletes all spaces and tabs around the cursor]
*** upcase/downcase
1. 'M-l' :downcase-word [Convert following word to lower case]
2. 'M-u' :upcase-word [Convert following word to upper case]
3. 'M-c' :capitalize-word [Capitalize the following word]
4. 'C-x C-l' :downcase-region [Convert region to lower case]
5. 'C-x C-u' :upcase-region [Convert region to upper case]
*** align
1. :align-current
2. :align-regexp [lets you align a region by a regex in complex ways]
*** rectangles
1. 'C-x r k' :kill-rectangle
2. 'C-x r d' :delete-rectangle
3. 'C-x r y' :yank-rectangle
4. 'C-x r o' :open-rectangle [Insert blank space to fill the space of the region-rectangle]
5. 'C-x r c' :clear-rectangle
6. 'M-x delete-whitespace-rectangle'
7. 'C-x r t' /string/ <RET> :string-rectangle [Replace rectangle contents with string on each line]
8. 'M-x string-insert-rectangle <RET>' /string/ <RET> [Insert string on each line of the rectangle.]
9. '[C-u] C-x r N' :rectangle-number-lines
*** org mode
1. 'C-c '(single quote)' : [edit included source code]
*** Search
1. 'C-M-s' : [regex i-search]
2. 'M-c' : [Typing M-c within an incremental search toggles the case sensitivity of that search.]
** org-mode
*** key
1. 'C-c C-j' : org-goto
2. 'C-c C-v' : org-babel
3. To insert a structural element, type a ‘<’, followed by a template selector and <TAB>.
#+BEGIN_VERSE
s	#+BEGIN_SRC ... #+END_SRC
e	#+BEGIN_EXAMPLE ... #+END_EXAMPLE
q	#+BEGIN_QUOTE ... #+END_QUOTE
v	#+BEGIN_VERSE ... #+END_VERSE
c	#+BEGIN_CENTER ... #+END_CENTER
l	#+BEGIN_LaTeX ... #+END_LaTeX
L	#+LaTeX:
h	#+BEGIN_HTML ... #+END_HTML
H	#+HTML:
a	#+BEGIN_ASCII ... #+END_ASCII
A	#+ASCII:
i	#+INDEX: line
I	#+INCLUDE: line
#+END_VERSE
** packages
*** update
1. [list-packages]: press 'U' for all packages which can be upgraded, and key 'x' to do upgrading.
2. [helm-list-elisp-packages]: 'M-U'
** features
*** coding
1. [set-buffer-file-coding-system]: 设置文件编码
*** log
1. keep-lines/flush-lines
* sql
** distinct
1. select distinct(id) from table; [选择并去重]
2. select count(distinct id) from table; [计算不重复的个数]
3. select *,count(distinct id) from table group by id; [以id为临时主键选取数据]
* wireshark
** tshark
1. analysis pcap file
tshark -r ssl_capture.pcap -d tcp.port==4443,ssl -R "(tcp.dstport eq 4443 and tcp.flags.syn == 1) or (tcp.srcport eq 4443 and ssl.change_cipher_spec)" -T fields -e frame.time_relative 2> /dev/null
* SSL/TLS
** 内容加密
加密算法分两种：对称加密和非对称加密。所谓对称加密（也叫密钥加密）就是加密和解密使用相同的密钥。而非对称加密（也叫公钥加密）就是指加密和解密使用了不同的密钥。
*** 非对称密钥交换
**** RSA密钥协商过程
1. 客户端发送client_hello, 包含随机数R1
2. 服务端回复server_hello，包含随机数R2，以及包含证书公钥P的certificate
3. 客户端使用R2生成premaster_secret和master_secret。premaster_secret长度为48个字节，前两个字节是协议版本，剩下的填充一个随机数
   Master_key = PRF(premaster_secrect, "master secert", R1 + R2)
   至此，客户端侧的密钥已经完成协商。
4. 客户端使用P加密premaster_secret并发送给服务端
5. 服务端使用私钥解密得到premaster_secret，使用相同的公式就可以得到master_secret
**** ECDHE密钥协商
1. 客户端发送client_hello，包含随机数R1和两个扩展
   1）elliptic_curves：客户端支持的曲线类型和有限域参数
   2）ec_point_formats：支持的曲线点格式，默认uncompressed
2. 服务端回复server_hello，包含随机数R2及ECC扩展。
3. 服务端回复certificate，携带了公钥
4. 服务端生成ECDH临时公钥，同时回复server_key_exchange，包含三个重要内容：
   1）ECC相关参数
   2）ECDH临时公钥
   3）ECC参数和公钥生成的签名值，用户客户端校验
5. 客户端接受server_key_exchange之后，使用证书公钥进行签名解密和校验，获取服务器端的ECDH临时公钥，生成共享密钥
   至此，客户端完成密钥协商
6. 客户端生成ECDH临时公钥和client_key_exchange消息，不需要加密
7. 服务器处理client_key_exchange消息，获取客户端ECDH临时公钥，最总生成共享密钥
* git
