_posts/2016-11-14-tips.html
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> makefile</h3>
<div class="outline-text-3" id="text-5-5">
</div><div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> variable assignments</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
1, makefile中的变量赋值其实就是字符串替换<br  />
2, "=" 递归展开变量：如果变量的定义引用了其它的变量，那么引用会一直展开下去，直到找到被引用的变量的最新的定义，并以此作为改变量的值返回<br  />
3, ":=" 简单扩展变量：在变量的定义点，按照被引用的变量的当前值进行展开<br  />
4, "+=" 为已定义的变量添加新的值<br  />
5, "?=" 赋默认值：如果没有初始化该变量，就给它赋上默认值<br  />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> emacs</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> key</h3>
<div class="outline-text-3" id="text-6-1">
</div><div id="outline-container-sec-6-1-1" class="outline-4">
<h4 id="sec-6-1-1"><span class="section-number-4">6.1.1</span> Blank</h4>
<div class="outline-text-4" id="text-6-1-1">
<ol class="org-ol">
<li>'C-x C-o' :delete-blank-lines [Delete extra blank lines between paragraphs]<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> File mode</h4>
<div class="outline-text-4" id="text-6-1-2">
</div><div id="outline-container-sec-6-1-2-1" class="outline-5">
<h5 id="sec-6-1-2-1"><span class="section-number-5">6.1.2.1</span> Open file in c++-mode</h5>
<div class="outline-text-5" id="text-6-1-2-1">
<ol class="org-ol">
<li>put "// -*-c++-*-" at the top of the file<br  />
</li>
<li>(add-to-list 'auto-mode-alist '("\\.h\\'" . c++-mode))<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> lines</h4>
<div class="outline-text-4" id="text-6-1-3">
<ol class="org-ol">
<li>'C-o' :open-line [Insert a blank line after the cursor]<br  />
</li>
<li>'C-M-o' :split-line [new line, and align it at same column of cursor]<br  />
</li>
<li>'M-^' :join this line to previous line<br  />
</li>
<li>'C-u M-^' :join following line to this line<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-4" class="outline-4">
<h4 id="sec-6-1-4"><span class="section-number-4">6.1.4</span> Indent</h4>
<div class="outline-text-4" id="text-6-1-4">
<ol class="org-ol">
<li>'M-/^/' :delete-indentation [join two line, and delete the front indentation of cursor]<br  />
</li>
<li>'C-M \' :indent-region [indents each line in the “usual” way]<br  />
</li>
<li>'&lt;TAB&gt;' :indent-region<br  />
</li>
<li>'C-x &lt;TAB&gt;' :indent-rigidly<br  />
</li>
<li>'M-m' :back-to-indentation<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-5" class="outline-4">
<h4 id="sec-6-1-5"><span class="section-number-4">6.1.5</span> Spaces</h4>
<div class="outline-text-4" id="text-6-1-5">
<ol class="org-ol">
<li>'M-\' :delete-horizontal-space [deletes all spaces and tabs around the cursor]<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-6" class="outline-4">
<h4 id="sec-6-1-6"><span class="section-number-4">6.1.6</span> upcase/downcase</h4>
<div class="outline-text-4" id="text-6-1-6">
<ol class="org-ol">
<li>'M-l' :downcase-word [Convert following word to lower case]<br  />
</li>
<li>'M-u' :upcase-word [Convert following word to upper case]<br  />
</li>
<li>'M-c' :capitalize-word [Capitalize the following word]<br  />
</li>
<li>'C-x C-l' :downcase-region [Convert region to lower case]<br  />
</li>
<li>'C-x C-u' :upcase-region [Convert region to upper case]<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-7" class="outline-4">
<h4 id="sec-6-1-7"><span class="section-number-4">6.1.7</span> align</h4>
<div class="outline-text-4" id="text-6-1-7">
<ol class="org-ol">
<li>:align-current<br  />
</li>
<li>:align-regexp [lets you align a region by a regex in complex ways]<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-8" class="outline-4">
<h4 id="sec-6-1-8"><span class="section-number-4">6.1.8</span> rectangles</h4>
<div class="outline-text-4" id="text-6-1-8">
<ol class="org-ol">
<li>'C-x r k' :kill-rectangle<br  />
</li>
<li>'C-x r d' :delete-rectangle<br  />
</li>
<li>'C-x r y' :yank-rectangle<br  />
</li>
<li>'C-x r o' :open-rectangle [Insert blank space to fill the space of the region-rectangle]<br  />
</li>
<li>'C-x r c' :clear-rectangle<br  />
</li>
<li>'M-x delete-whitespace-rectangle'<br  />
</li>
<li>'C-x r t' <i>string</i> &lt;RET&gt; :string-rectangle [Replace rectangle contents with string on each line]<br  />
</li>
<li>'M-x string-insert-rectangle &lt;RET&gt;' <i>string</i> &lt;RET&gt; [Insert string on each line of the rectangle.]<br  />
</li>
<li>'[C-u] C-x r N' :rectangle-number-lines<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-9" class="outline-4">
<h4 id="sec-6-1-9"><span class="section-number-4">6.1.9</span> org mode</h4>
<div class="outline-text-4" id="text-6-1-9">
<ol class="org-ol">
<li>'C-c '(single quote)' : [edit included source code]<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-6-1-10" class="outline-4">
<h4 id="sec-6-1-10"><span class="section-number-4">6.1.10</span> Search</h4>
<div class="outline-text-4" id="text-6-1-10">
<ol class="org-ol">
<li>'C-M-s' : [regex i-search]<br  />
</li>
<li>'M-c' : [Typing M-c within an incremental search toggles the case sensitivity of that search.]<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> org-mode</h3>
<div class="outline-text-3" id="text-6-2">
</div><div id="outline-container-sec-6-2-1" class="outline-4">
<h4 id="sec-6-2-1"><span class="section-number-4">6.2.1</span> key</h4>
<div class="outline-text-4" id="text-6-2-1">
<ol class="org-ol">
<li>'C-c C-j' : org-goto<br  />
</li>
<li>'C-c C-v' : org-babel<br  />
</li>
<li>To insert a structural element, type a ‘&lt;’, followed by a template selector and &lt;TAB&gt;.<br  />
</li>
</ol>
<p class="verse">
s        #+BEGIN_SRC &#x2026; #+END_SRC<br  /><br  />
e        #+BEGIN_EXAMPLE &#x2026; #+END_EXAMPLE<br  /><br  />
q        #+BEGIN_QUOTE &#x2026; #+END_QUOTE<br  /><br  />
v        #+BEGIN_VERSE &#x2026; #+END_VERSE<br  /><br  />
c        #+BEGIN_CENTER &#x2026; #+END_CENTER<br  /><br  />
l        #+BEGIN_LaTeX &#x2026; #+END_LaTeX<br  /><br  />
L        #+LaTeX:<br  /><br  />
h        #+BEGIN_HTML &#x2026; #+END_HTML<br  /><br  />
H        #+HTML:<br  /><br  />
a        #+BEGIN_ASCII &#x2026; #+END_ASCII<br  /><br  />
A        #+ASCII:<br  /><br  />
i        #+INDEX: line<br  /><br  />
I        #+INCLUDE: line<br  /><br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> packages</h3>
<div class="outline-text-3" id="text-6-3">
</div><div id="outline-container-sec-6-3-1" class="outline-4">
<h4 id="sec-6-3-1"><span class="section-number-4">6.3.1</span> update</h4>
<div class="outline-text-4" id="text-6-3-1">
<ol class="org-ol">
<li>[list-packages]: press 'U' for all packages which can be upgraded, and key 'x' to do upgrading.<br  />
</li>
<li>[helm-list-elisp-packages]: 'M-U'<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> features</h3>
<div class="outline-text-3" id="text-6-4">
</div><div id="outline-container-sec-6-4-1" class="outline-4">
<h4 id="sec-6-4-1"><span class="section-number-4">6.4.1</span> coding</h4>
<div class="outline-text-4" id="text-6-4-1">
<ol class="org-ol">
<li>[set-buffer-file-coding-system]: 设置文件编码<br  />
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> sql</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> distinct</h3>
<div class="outline-text-3" id="text-7-1">
<ol class="org-ol">
<li>select distinct(id) from table; [选择并去重]<br  />
</li>
<li>select count(distinct id) from table; [计算不重复的个数]<br  />
</li>
<li>select *,count(distinct id) from table group by id; [以id为临时主键选取数据]<br  />
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> wireshark</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> tshark</h3>
<div class="outline-text-3" id="text-8-1">
<ol class="org-ol">
<li>analysis pcap file<br  />
</li>
</ol>
<p>
tshark -r ssl_capture.pcap -d tcp.port==4443,ssl -R "(tcp.dstport eq 4443 and tcp.flags.syn == 1) or (tcp.srcport eq 4443 and ssl.change_cipher_spec)" -T fields -e frame.time_relative 2&gt; /dev/null<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> SSL/TLS</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> 内容加密</h3>
<div class="outline-text-3" id="text-9-1">
<p>
加密算法分两种：对称加密和非对称加密。所谓对称加密（也叫密钥加密）就是加密和解密使用相同的密钥。而非对称加密（也叫公钥加密）就是指加密和解密使用了不同的密钥。<br  />
</p>
</div>
<div id="outline-container-sec-9-1-1" class="outline-4">
<h4 id="sec-9-1-1"><span class="section-number-4">9.1.1</span> 非对称密钥交换</h4>
<div class="outline-text-4" id="text-9-1-1">
</div><div id="outline-container-sec-9-1-1-1" class="outline-5">
<h5 id="sec-9-1-1-1"><span class="section-number-5">9.1.1.1</span> RSA密钥协商过程</h5>
<div class="outline-text-5" id="text-9-1-1-1">
<ol class="org-ol">
<li>客户端发送client_hello, 包含随机数R1<br  />
</li>
<li>服务端回复server_hello，包含随机数R2，以及包含证书公钥P的certificate<br  />
</li>
<li>客户端使用R2生成premaster_secret和master_secret。premaster_secret长度为48个字节，前两个字节是协议版本，剩下的填充一个随机数<br  />
Master_key = PRF(premaster_secrect, "master secert", R1 + R2)<br  />
至此，客户端侧的密钥已经完成协商。<br  />
</li>
<li>客户端使用P加密premaster_secret并发送给服务端<br  />
</li>
<li>服务端使用私钥解密得到premaster_secret，使用相同的公式就可以得到master_secret<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-9-1-1-2" class="outline-5">
<h5 id="sec-9-1-1-2"><span class="section-number-5">9.1.1.2</span> ECDHE密钥协商</h5>
<div class="outline-text-5" id="text-9-1-1-2">
<ol class="org-ol">
<li>客户端发送client_hello，包含随机数R1和两个扩展<br  />
   1）elliptic_curves：客户端支持的曲线类型和有限域参数<br  />
   2）ec_point_formats：支持的曲线点格式，默认uncompressed<br  />
</li>
<li>服务端回复server_hello，包含随机数R2及ECC扩展。<br  />
</li>
<li>服务端回复certificate，携带了公钥<br  />
</li>
<li>服务端生成ECDH临时公钥，同时回复server_key_exchange，包含三个重要内容：<br  />
1）ECC相关参数<br  />
2）ECDH临时公钥<br  />
3）ECC参数和公钥生成的签名值，用户客户端校验<br  />
</li>
<li>客户端接受server_key_exchange之后，使用证书公钥进行签名解密和校验，获取服务器端的ECDH临时公钥，生成共享密钥<br  />
   至此，客户端完成密钥协商<br  />
</li>
<li>客户端生成ECDH临时公钥和client_key_exchange消息，不需要加密<br  />
</li>
<li>服务器处理client_key_exchange消息，获取客户端ECDH临时公钥，最总生成共享密钥<br  />
</li>
</ol>
</div>
</div>
</div>
</div>
</div>
