_org/_posts/2016-11-14-tips.org
** patch
#+begin_src sh
$ git format -n commit //生成最近n个点的patch
#+end_src
* android
** ContentProvider
*** 基本概念
安卓不同应用或服务间共享数据的一种方式，C/S模式，提供insert/delete/update/query四种接口，使用SQL语法设计接口参数。
*** 开发指导
**** Provider
1. 继承android.content.ContentProvider, 实现insert/delete/update/query四个接口
2. manifest文件中在application节点定义provider，包括name/authorities和permission。可以使用path-permission限定数据访问集合
#+BEGIN_SRC java
<application>
        <provider android:name=".BookmarkProvider"
                  android:authorities="com.android.browser;browser"
                  android:multiprocess="false"
                  android:exported="true"
                  android:readPermission="com.android.browser.permission.READ_HISTORY_BOOKMARKS"
                  android:writePermission="com.android.browser.permission.WRITE_HISTORY_BOOKMARKS">
            <path-permission android:path="/bookmarks/search_suggest_query"
                    android:readPermission="android.permission.GLOBAL_SEARCH" />
        </provider>
    </application>
#+END_SRC
3. 使用UriMatcher指定Content Uri Path和ID，指向不同的数据集
**** Requester
1. manifest文件中声明permission
2. 使用getContentResolver().insert/query/update/delete
**** 关于global_search
1. Provider声明了android.permission.GLOBAL_SEARCH，其他应用可以在不知道authority的情况下获取需要的数据
2. Provider要添加res/xml/searchable.xml，关键说明searchSuggestAuthority、searchSuggestPath和searchSuggestSelection
#+BEGIN_SRC java
<searchable xmlns:android="http://schemas.android.com/apk/res/android"
    android:label="@string/app_name_title"
    android:includeInGlobalSearch="true"
    android:searchSettingsDescription="@string/bookmarks_fragment_title"
    android:searchSuggestAuthority="com.android.browser"
    android:searchSuggestIntentAction="android.intent.action.VIEW"
    android:searchSuggestPath="bookmarks"
    android:searchSuggestSelection="url LIKE ?"/>
#+END_SRC
3. Requester可以通过SearchManager.getSearchablesInGlobalSearch，获得searchable列表，从而得到想要的数据
#+BEGIN_SRC java
  SearchManager searchManager = (SearchManager) this.getSystemService(Context.SEARCH_SERVICE);
          List<SearchableInfo> searchableInfos = searchManager.getSearchablesInGlobalSearch();
          if (searchableInfos == null) return null;
          for (SearchableInfo si : searchableInfos) {
              ...
          }
#+END_SRC
**** 其他
1. content uri格式: content://authority/path[/#id]
2. command tools:
#+BEGIN_SRC shell
$ adb shell content
#+END_SRC

** 小米adb
1, *#*#717717#*#* 调试号码
** run-as
1, 非root手机，debug包，以包名用户运行
#+BEGIN_SRC sh
$ adb shell
$ run-as com.android.browser
#+END_SRC
* Speedy
* Algorithm
** 排序算法
**** 快速排序
***** 算法步骤
1. 选择一个元素作为基准值
2. 把比基准值小的元素放左边，比基准值大的放右边，一样大的可换可不换
3. 按相同的方式分别处理基准值两侧的元素集合
经过一趟快排后，基准值的位置就固定了
***** 性能
平均状况下时间复杂度是O(nlogn), 最差情况下是O(n^2)
**** 堆排序算法
***** 算法步骤
1. 把n个元素的集合建立成堆
2. 将堆顶和最后一个元素调换
3. 将剩余n-1个元素重复a->b的过程
利用大小堆的近似完全二叉树的存储结构，建堆取堆顶元素
***** 性能
平均性能的时间复杂度是O(nlogn)
辅助空间是O(1)
是一种不稳定的排序算法
**** 归并排序
***** 算法步骤
应用分治法
1. 请空间，使其大小为两个已排序序列大小之和
2. 用两个指针，分别指向两个序列的首部
3. 较两个指针指向的元素大小，选择相对小的放到合并空间，指针移位
4. 复c，直到有指针到尾
5. 另一个指针的元素直接合并到申请空间
***** 性能
仅次于快排，是一种稳定的算法。
时间复杂度是O(nlogn)，空间复杂度是O(n)
**** 二分查找
必须顺序存储，必须按关键字有序
***** 算法步骤
1. 选择中间位置，比较大小
2. 如果不同，则继续在相应的折半区间从中间位置开始比较
***** 性能
时间复杂度O(logn)
**** BFPRT(线性查找算法)
从n个元素中选取第k大小的元素，可以保证在最坏情况下仍为线性复杂度
***** 算法步骤
1. 将n个元素按5个一组，分成n/5组
2. 使用任意排序方法排列每个分组，确定每个组的中位数
3. 按1->2递归的选取最后的中位数x，偶数个元素选取较小的一个
4. 用x来分割元素集，比x小的[k]放左边，大的[n-k]放右边，即快排的一次分区(partion)
5. 如果i==k，则返回x；如果i<k，则在小于x的元素中递归查找第i小的元素；否则在大于x的元素中查找第i-k小的元素
***** 性能
最坏情况下时间复杂度为O(n)
**** DFS(深度优先搜索)
沿着树的深度遍历树的节点，尽可能深的搜索树的分支。当节点v的所有边都己被探寻过，搜索将回溯到发现节点v的那条边的起始节点
***** 算法步骤
1. 选取图中某一顶点Vi，访问并标记该顶点
2. 以Vi为当前顶点，依次搜索Vi的邻接点Vj；如果Vj没有被访问过，则访问和标记Vj；如果Vj已经被访问过，则访问Vi的下一个邻接点
3. 以Vj为当前顶点，重复步骤2)，直到图中和Vi有路径相通的点都被访问过
4. 如果图中还有尚未被访问的点，则选取一个重复上面的过程，直到所有的点被访问
***** 性能
是盲目搜索，迷宫问题/8皇后问题
