_posts/2016-11-14-tips.html
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> git</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> patch</h3>
<div class="outline-text-3" id="text-10-1">
<div class="org-src-container">

<pre class="src src-sh">$ git format -n commit //&#29983;&#25104;&#26368;&#36817;n&#20010;&#28857;&#30340;patch
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> android</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> ContentProvider</h3>
<div class="outline-text-3" id="text-11-1">
</div><div id="outline-container-sec-11-1-1" class="outline-4">
<h4 id="sec-11-1-1"><span class="section-number-4">11.1.1</span> 基本概念</h4>
<div class="outline-text-4" id="text-11-1-1">
<p>
安卓不同应用或服务间共享数据的一种方式，C/S模式，提供insert/delete/update/query四种接口，使用SQL语法设计接口参数。<br  />
</p>
</div>
</div>
<div id="outline-container-sec-11-1-2" class="outline-4">
<h4 id="sec-11-1-2"><span class="section-number-4">11.1.2</span> 开发指导</h4>
<div class="outline-text-4" id="text-11-1-2">
</div><div id="outline-container-sec-11-1-2-1" class="outline-5">
<h5 id="sec-11-1-2-1"><span class="section-number-5">11.1.2.1</span> Provider</h5>
<div class="outline-text-5" id="text-11-1-2-1">
<ol class="org-ol">
<li>继承android.content.ContentProvider, 实现insert/delete/update/query四个接口<br  />
</li>
<li>manifest文件中在application节点定义provider，包括name/authorities和permission。可以使用path-permission限定数据访问集合<br  />
</li>
</ol>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #2aa198;">&lt;</span><span style="color: #b58900;">application</span><span style="color: #2aa198;">&gt;</span>
        &lt;provider android:name=<span style="color: #2aa198;">".BookmarkProvider"</span>
                  android:authorities=<span style="color: #2aa198;">"com.android.browser;browser"</span>
                  android:multiprocess=<span style="color: #2aa198;">"false"</span>
                  android:exported=<span style="color: #2aa198;">"true"</span>
                  android:readPermission=<span style="color: #2aa198;">"com.android.browser.permission.READ_HISTORY_BOOKMARKS"</span>
                  android:writePermission=<span style="color: #2aa198;">"com.android.browser.permission.WRITE_HISTORY_BOOKMARKS"</span>&gt;
            &lt;path-permission android:path=<span style="color: #2aa198;">"/bookmarks/search_suggest_query"</span>
                    android:readPermission=<span style="color: #2aa198;">"android.permission.GLOBAL_SEARCH"</span> /&gt;
        &lt;/provider&gt;
    &lt;/application&gt;
</pre>
</div>
<ol class="org-ol">
<li>使用UriMatcher指定Content Uri Path和ID，指向不同的数据集<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-11-1-2-2" class="outline-5">
<h5 id="sec-11-1-2-2"><span class="section-number-5">11.1.2.2</span> Requester</h5>
<div class="outline-text-5" id="text-11-1-2-2">
<ol class="org-ol">
<li>manifest文件中声明permission<br  />
</li>
<li>使用getContentResolver().insert/query/update/delete<br  />
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-11-1-2-3" class="outline-5">
<h5 id="sec-11-1-2-3"><span class="section-number-5">11.1.2.3</span> 关于global_search</h5>
<div class="outline-text-5" id="text-11-1-2-3">
<ol class="org-ol">
<li>Provider声明了android.permission.GLOBAL_SEARCH，其他应用可以在不知道authority的情况下获取需要的数据<br  />
</li>
<li>Provider要添加res/xml/searchable.xml，关键说明searchSuggestAuthority、searchSuggestPath和searchSuggestSelection<br  />
</li>
</ol>
<div class="org-src-container">

<pre class="src src-java">&lt;searchable xmlns:android=<span style="color: #2aa198;">"http://schemas.android.com/apk/res/android"</span>
    android:label=<span style="color: #2aa198;">"@string/app_name_title"</span>
    android:includeInGlobalSearch=<span style="color: #2aa198;">"true"</span>
    android:searchSettingsDescription=<span style="color: #2aa198;">"@string/bookmarks_fragment_title"</span>
    android:searchSuggestAuthority=<span style="color: #2aa198;">"com.android.browser"</span>
    android:searchSuggestIntentAction=<span style="color: #2aa198;">"android.intent.action.VIEW"</span>
    android:searchSuggestPath=<span style="color: #2aa198;">"bookmarks"</span>
    android:searchSuggestSelection=<span style="color: #2aa198;">"url LIKE ?"</span>/&gt;
</pre>
</div>
<ol class="org-ol">
<li>Requester可以通过SearchManager.getSearchablesInGlobalSearch，获得searchable列表，从而得到想要的数据<br  />
</li>
</ol>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #b58900;">SearchManager</span> <span style="color: #268bd2;">searchManager</span> = <span style="color: #2aa198;">(</span><span style="color: #b58900;">SearchManager</span><span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">this</span>.getSystemService<span style="color: #2aa198;">(</span><span style="color: #268bd2; font-weight: bold;">Context</span>.SEARCH_SERVICE<span style="color: #2aa198;">)</span>;
        <span style="color: #b58900;">List</span><span style="color: #2aa198;">&lt;</span><span style="color: #b58900;">SearchableInfo</span><span style="color: #2aa198;">&gt;</span> <span style="color: #268bd2;">searchableInfos</span> = searchManager.getSearchablesInGlobalSearch<span style="color: #2aa198;">()</span>;
        <span style="color: #859900; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>searchableInfos == <span style="color: #268bd2; font-weight: bold;">null</span><span style="color: #2aa198;">)</span> <span style="color: #859900; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">null</span>;
        <span style="color: #859900; font-weight: bold;">for</span> <span style="color: #2aa198;">(</span><span style="color: #b58900;">SearchableInfo</span> <span style="color: #268bd2;">si</span> : searchableInfos<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
            ...
        <span style="color: #2aa198;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-1-2-4" class="outline-5">
<h5 id="sec-11-1-2-4"><span class="section-number-5">11.1.2.4</span> 其他</h5>
<div class="outline-text-5" id="text-11-1-2-4">
<ol class="org-ol">
<li>content uri格式: content://authority/path[/#id]<br  />
</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> 小米adb</h3>
<div class="outline-text-3" id="text-11-2">
<p>
1, <b>#*#717717#*#</b> 调试号码<br  />
</p>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> run-as</h3>
<div class="outline-text-3" id="text-11-3">
<p>
1, 非root手机，debug包，以包名用户运行<br  />
</p>
<div class="org-src-container">

<pre class="src src-sh">$ adb shell
$ run-as com.android.browser
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Speedy</h2>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Algorithm</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-sec-13-1" class="outline-3">
<h3 id="sec-13-1"><span class="section-number-3">13.1</span> 排序算法</h3>
<div class="outline-text-3" id="text-13-1">
</div><div id="outline-container-sec-13-1-0-1" class="outline-5">
<h5 id="sec-13-1-0-1"><span class="section-number-5">13.1.0.1</span> 快速排序</h5>
<div class="outline-text-5" id="text-13-1-0-1">
</div><ol class="org-ol"><li><a id="sec-13-1-0-1-1" name="sec-13-1-0-1-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-1-1">
<ol class="org-ol">
<li>选择一个元素作为基准值<br  />
</li>
<li>把比基准值小的元素放左边，比基准值大的放右边，一样大的可换可不换<br  />
</li>
<li>按相同的方式分别处理基准值两侧的元素集合<br  />
</li>
</ol>
<p>
经过一趟快排后，基准值的位置就固定了<br  />
</p>
</div>
</li>
<li><a id="sec-13-1-0-1-2" name="sec-13-1-0-1-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-1-2">
<p>
平均状况下时间复杂度是O(nlogn), 最差情况下是O(n^2)<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-2" class="outline-5">
<h5 id="sec-13-1-0-2"><span class="section-number-5">13.1.0.2</span> 堆排序算法</h5>
<div class="outline-text-5" id="text-13-1-0-2">
</div><ol class="org-ol"><li><a id="sec-13-1-0-2-1" name="sec-13-1-0-2-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-2-1">
<ol class="org-ol">
<li>把n个元素的集合建立成堆<br  />
</li>
<li>将堆顶和最后一个元素调换<br  />
</li>
<li>将剩余n-1个元素重复a-&gt;b的过程<br  />
</li>
</ol>
<p>
利用大小堆的近似完全二叉树的存储结构，建堆取堆顶元素<br  />
</p>
</div>
</li>
<li><a id="sec-13-1-0-2-2" name="sec-13-1-0-2-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-2-2">
<p>
平均性能的时间复杂度是O(nlogn)<br  />
辅助空间是O(1)<br  />
是一种不稳定的排序算法<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-3" class="outline-5">
<h5 id="sec-13-1-0-3"><span class="section-number-5">13.1.0.3</span> 归并排序</h5>
<div class="outline-text-5" id="text-13-1-0-3">
</div><ol class="org-ol"><li><a id="sec-13-1-0-3-1" name="sec-13-1-0-3-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-3-1">
<p>
应用分治法<br  />
</p>
<ol class="org-ol">
<li>请空间，使其大小为两个已排序序列大小之和<br  />
</li>
<li>用两个指针，分别指向两个序列的首部<br  />
</li>
<li>较两个指针指向的元素大小，选择相对小的放到合并空间，指针移位<br  />
</li>
<li>复c，直到有指针到尾<br  />
</li>
<li>另一个指针的元素直接合并到申请空间<br  />
</li>
</ol>
</div>
</li>
<li><a id="sec-13-1-0-3-2" name="sec-13-1-0-3-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-3-2">
<p>
仅次于快排，是一种稳定的算法。<br  />
时间复杂度是O(nlogn)，空间复杂度是O(n)<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-4" class="outline-5">
<h5 id="sec-13-1-0-4"><span class="section-number-5">13.1.0.4</span> 二分查找</h5>
<div class="outline-text-5" id="text-13-1-0-4">
<p>
必须顺序存储，必须按关键字有序<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-13-1-0-4-1" name="sec-13-1-0-4-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-4-1">
<ol class="org-ol">
<li>选择中间位置，比较大小<br  />
</li>
<li>如果不同，则继续在相应的折半区间从中间位置开始比较<br  />
</li>
</ol>
</div>
</li>
<li><a id="sec-13-1-0-4-2" name="sec-13-1-0-4-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-4-2">
<p>
时间复杂度O(logn)<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-5" class="outline-5">
<h5 id="sec-13-1-0-5"><span class="section-number-5">13.1.0.5</span> BFPRT(线性查找算法)</h5>
<div class="outline-text-5" id="text-13-1-0-5">
<p>
从n个元素中选取第k大小的元素，可以保证在最坏情况下仍为线性复杂度<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-13-1-0-5-1" name="sec-13-1-0-5-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-5-1">
<ol class="org-ol">
<li>将n个元素按5个一组，分成n/5组<br  />
</li>
<li>使用任意排序方法排列每个分组，确定每个组的中位数<br  />
</li>
<li>按1-&gt;2递归的选取最后的中位数x，偶数个元素选取较小的一个<br  />
</li>
<li>用x来分割元素集，比x小的[k]放左边，大的[n-k]放右边，即快排的一次分区(partion)<br  />
</li>
<li>如果i==k，则返回x；如果i&lt;k，则在小于x的元素中递归查找第i小的元素；否则在大于x的元素中查找第i-k小的元素<br  />
</li>
</ol>
</div>
</li>
<li><a id="sec-13-1-0-5-2" name="sec-13-1-0-5-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-5-2">
<p>
最坏情况下时间复杂度为O(n)<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-6" class="outline-5">
<h5 id="sec-13-1-0-6"><span class="section-number-5">13.1.0.6</span> DFS(深度优先搜索)</h5>
<div class="outline-text-5" id="text-13-1-0-6">
<p>
沿着树的深度遍历树的节点，尽可能深的搜索树的分支。当节点v的所有边都己被探寻过，搜索将回溯到发现节点v的那条边的起始节点<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-13-1-0-6-1" name="sec-13-1-0-6-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-6-1">
<ol class="org-ol">
<li>选取图中某一顶点Vi，访问并标记该顶点<br  />
</li>
<li>以Vi为当前顶点，依次搜索Vi的邻接点Vj；如果Vj没有被访问过，则访问和标记Vj；如果Vj已经被访问过，则访问Vi的下一个邻接点<br  />
</li>
<li>以Vj为当前顶点，重复步骤2)，直到图中和Vi有路径相通的点都被访问过<br  />
</li>
<li>如果图中还有尚未被访问的点，则选取一个重复上面的过程，直到所有的点被访问<br  />
</li>
</ol>
</div>
</li>
<li><a id="sec-13-1-0-6-2" name="sec-13-1-0-6-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-6-2">
<p>
是盲目搜索，迷宫问题/8皇后问题<br  />
</p>
</div>
</li></ol>
</div>
