_org/_posts/2016-11-14-tips.org
**** BFS(广度优先算法)
BFS是从根节点开始，沿着树(图)的宽度遍历树(图)的节点。如果所有节点均被访问，则算法中止
***** 算法步骤
用队列辅助实现
1. 首先将根节点放入队列
2. 从队列中取出第一个节点，检验是否为目标，否则将其直接子节点放入队列中
3. 若队列为空，表示整张图都已经遍历过了
4. 重复步骤2
***** 性能
是盲目搜索
**** Dijkstra算法
典型的单源最短路径算法，用于计算一个节点到其他所有节点的最短路径
***** 算法步骤
1. 初始时，S只包含一个源点，s={v}。U包含其他顶点，若v与U中顶点有连接，则<v,u>有权重，否则为无穷大
2. 从U中选取一个距离v最小的点k，把k列入S中
3. 以k为新考虑的中间点，计算U中各顶点的距离；若从k经过的到u的距离比原来的距离短，则修改u的距离值，为经过k的距离值
4. 重复2)->3)，直到所有点都在S中
**** 动态规划算法
参看[[https://www.topcoder.com/community/data-science/data-science-tutorials/dynamic-programming-from-novice-to-advanced/][dynamic-programming-from-novice-to-advanced]]
中文版[[http://www.hawstein.com/posts/dp-novice-to-advanced.html][动态规划：从新手到专家]]
