_posts/2016-11-14-tips.html
<div id="outline-container-sec-13-1-0-7" class="outline-5">
<h5 id="sec-13-1-0-7"><span class="section-number-5">13.1.0.7</span> BFS(广度优先算法)</h5>
<div class="outline-text-5" id="text-13-1-0-7">
<p>
BFS是从根节点开始，沿着树(图)的宽度遍历树(图)的节点。如果所有节点均被访问，则算法中止<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-13-1-0-7-1" name="sec-13-1-0-7-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-7-1">
<p>
用队列辅助实现<br  />
</p>
<ol class="org-ol">
<li>首先将根节点放入队列<br  />
</li>
<li>从队列中取出第一个节点，检验是否为目标，否则将其直接子节点放入队列中<br  />
</li>
<li>若队列为空，表示整张图都已经遍历过了<br  />
</li>
<li>重复步骤2<br  />
</li>
</ol>
</div>
</li>
<li><a id="sec-13-1-0-7-2" name="sec-13-1-0-7-2"></a>性能<br  /><div class="outline-text-6" id="text-13-1-0-7-2">
<p>
是盲目搜索<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-8" class="outline-5">
<h5 id="sec-13-1-0-8"><span class="section-number-5">13.1.0.8</span> Dijkstra算法</h5>
<div class="outline-text-5" id="text-13-1-0-8">
<p>
典型的单源最短路径算法，用于计算一个节点到其他所有节点的最短路径<br  />
</p>
</div>
<ol class="org-ol"><li><a id="sec-13-1-0-8-1" name="sec-13-1-0-8-1"></a>算法步骤<br  /><div class="outline-text-6" id="text-13-1-0-8-1">
<ol class="org-ol">
<li>初始时，S只包含一个源点，s={v}。U包含其他顶点，若v与U中顶点有连接，则&lt;v,u&gt;有权重，否则为无穷大<br  />
</li>
<li>从U中选取一个距离v最小的点k，把k列入S中<br  />
</li>
<li>以k为新考虑的中间点，计算U中各顶点的距离；若从k经过的到u的距离比原来的距离短，则修改u的距离值，为经过k的距离值<br  />
</li>
<li>重复2)-&gt;3)，直到所有点都在S中<br  />
</li>
</ol>
</div>
</li></ol>
</div>
<div id="outline-container-sec-13-1-0-9" class="outline-5">
<h5 id="sec-13-1-0-9"><span class="section-number-5">13.1.0.9</span> 动态规划算法</h5>
<div class="outline-text-5" id="text-13-1-0-9">
<p>
参看<a href="https://www.topcoder.com/community/data-science/data-science-tutorials/dynamic-programming-from-novice-to-advanced/">dynamic-programming-from-novice-to-advanced</a><br  />
中文版<a href="http://www.hawstein.com/posts/dp-novice-to-advanced.html">动态规划：从新手到专家</a><br  />
</p>
</div>
</div>
</div>
</div>
